load-test/results/elastic_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking host.docker.internal (be patient)


Server Software:        uvicorn
Server Hostname:        host.docker.internal
Server Port:            8000

Document Path:          /health/elastic
Document Length:        66 bytes

Concurrency Level:      10
Time taken for tests:   3.397 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      210000 bytes
HTML transferred:       66000 bytes
Requests per second:    294.37 [#/sec] (mean)
Time per request:       33.971 [ms] (mean)
Time per request:       3.397 [ms] (mean, across all concurrent requests)
Transfer rate:          60.37 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    3   1.9      2      26
Processing:    10   31   8.5     29      80
Waiting:        9   29   8.1     27      78
Total:         13   34   8.9     32      82

Percentage of the requests served within a certain time (ms)
  50%     32
  66%     34
  75%     36
  80%     39
  90%     44
  95%     49
  98%     61
  99%     76
 100%     82 (longest request)